       identification division.
       program-id. adventofcode.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           display "Hello, world!"
           goback.

       end program adventofcode.

